Dasani-Rails/app/controllers/chat_controller.rb

SELECT * FROM "stratus_keys" WHERE ("stratus_keys"."key" = 'a44e703328818e56cca3cd1bbdd2f30584a4acfdee30da0b5a7ccc44409b48c0') LIMIT 1
INSERT INTO "stratus_keys" ("updated_at", "connected", "user_id", "key", "created_at") VALUES('2010-07-02 03:16:17', 'f', NULL, '37d6770a50502a290e5143568b2c07b783717abd37884f1860efccff0f8e50f3', '2010-07-02 03:16:17')
UPDATE "stratus_keys" SET "connected" = 't', "updated_at" = '2010-07-02 03:25:09' WHERE "id" = 16
SELECT * FROM "stratus_keys" WHERE ("stratus_keys"."connected" = 'f')
---
  def connect
    @key = params[0][:key]
    @client = StratusKey.find(:first, :conditions=>{:key=>@key})
    if @client.blank?
      @client = StratusKey.new
      @client.key = @key
      @client.connected = false
      @client.save
    end
    @peers = StratusKey.find(:all, :conditions=>['key <> ? AND connected = ?', @key, false])

SELECT * FROM "stratus_keys" WHERE ("stratus_keys"."key" = '8dbdf2a7b9a9d99fe9fcd34da76e64adcd6732815e5a18da1384154cbdc4efb9') LIMIT 1
DELETE FROM "stratus_keys" WHERE "id" = 54
---
  def disconnectChat
    @key = params[0][:key]
    @partner_key = params[0][:partner_key]
    if !(@key.blank?)
      @client = StratusKey.find(:first, :conditions=>{:key=>@key})
      if !(@client.blank?)
        StratusKey.destroy(@client.id)